//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

███╗░░░███╗██████╗░
████╗░████║██╔══██╗
██╔████╔██║██║░░██║
██║╚██╔╝██║██║░░██║
██║░╚═╝░██║██████╔╝
╚═╝░░░░░╚═╝╚═════╝░

██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

░█████╗░██╗░░░██╗
██╔═══╝░██║░░░██║
██████╗░╚██╗░██╔╝
██╔══██╗░╚████╔╝░
╚█████╔╝░░╚██╔╝░░
░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

const _0xe2858a=_0x1711;function _0x1711(_0x7ea8f5,_0x28b628){const _0x33877e=_0x3387();return _0x1711=function(_0x1711b6,_0x37b99c){_0x1711b6=_0x1711b6-0x11b;let _0x3cdd18=_0x33877e[_0x1711b6];return _0x3cdd18;},_0x1711(_0x7ea8f5,_0x28b628);}(function(_0x5b0f43,_0xab2aaa){const _0x2e893e=_0x1711,_0x5e5145=_0x5b0f43();while(!![]){try{const _0x11d356=parseInt(_0x2e893e(0x123))/0x1*(parseInt(_0x2e893e(0x131))/0x2)+parseInt(_0x2e893e(0x11f))/0x3+parseInt(_0x2e893e(0x126))/0x4+-parseInt(_0x2e893e(0x133))/0x5*(-parseInt(_0x2e893e(0x12c))/0x6)+-parseInt(_0x2e893e(0x135))/0x7+-parseInt(_0x2e893e(0x124))/0x8+-parseInt(_0x2e893e(0x121))/0x9*(-parseInt(_0x2e893e(0x129))/0xa);if(_0x11d356===_0xab2aaa)break;else _0x5e5145['push'](_0x5e5145['shift']());}catch(_0x2e7973){_0x5e5145['push'](_0x5e5145['shift']());}}}(_0x3387,0x4cb45));const axios=require('axios'),{cmd}=require(_0xe2858a(0x120));cmd({'pattern':_0xe2858a(0x12a),'desc':_0xe2858a(0x127),'react':'🔍','category':'other','filename':__filename},async(_0x527889,_0x22d532,_0x1af327,{from:_0x17955f,q:_0x1f7901,reply:_0x6402b5})=>{const _0x3ef4cc=_0xe2858a;try{if(!_0x1f7901)return _0x6402b5(_0x3ef4cc(0x130));const _0x1610fa=_0x1f7901,_0x30c89b=_0x3ef4cc(0x132)+_0x1610fa,_0x56aa88=await axios['get'](_0x30c89b),_0x374d49=_0x56aa88['data'][0x0],_0x99f864=_0x374d49[_0x3ef4cc(0x137)][0x0][_0x3ef4cc(0x12d)][0x0]['definition'],_0x2c8bb0=_0x374d49[_0x3ef4cc(0x137)][0x0][_0x3ef4cc(0x12d)][0x0][_0x3ef4cc(0x128)]||_0x3ef4cc(0x122),_0x1d6d38=_0x374d49[_0x3ef4cc(0x137)][0x0][_0x3ef4cc(0x12d)][0x0][_0x3ef4cc(0x11e)][_0x3ef4cc(0x12e)](',\x20')||_0x3ef4cc(0x12f),_0x464621=_0x3ef4cc(0x138)+_0x374d49[_0x3ef4cc(0x11b)]+_0x3ef4cc(0x11c)+_0x99f864+_0x3ef4cc(0x136)+_0x2c8bb0+_0x3ef4cc(0x134)+_0x1d6d38+'\x0a\x0a>\x20❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣';return _0x6402b5(_0x464621);}catch(_0x320965){console[_0x3ef4cc(0x12b)](_0x320965);if(_0x320965[_0x3ef4cc(0x125)]&&_0x320965[_0x3ef4cc(0x125)][_0x3ef4cc(0x11d)]===0x194)return _0x6402b5('🚫\x20Word\x20not\x20found.\x20Please\x20check\x20the\x20spelling\x20and\x20try\x20again.');return _0x6402b5('⚠️\x20An\x20error\x20occurred\x20while\x20fetching\x20the\x20definition.\x20Please\x20try\x20again\x20later.');}});function _0x3387(){const _0x377678=['1645182kBvecp','\x0a\x0a📝\x20*Example*:\x20','meanings','\x0a\x0a📚\x20*Word*:\x20','word','\x0a\x0a🔍\x20*Definition*:\x20','status','synonyms','307164Pzloxt','../command','117bwCHIt','No\x20example\x20available','210857VMeuYi','3454136vecMFM','response','357796wFQWsQ','📚\x20Get\x20the\x20definition\x20of\x20a\x20word','example','434990AJiyfh','define','log','66mcBmYx','definitions','join','No\x20synonyms\x20available','❗\x20Please\x20provide\x20a\x20word\x20to\x20define.\x20Usage:\x20.define\x20[word]','2WPGCBb','https://api.dictionaryapi.dev/api/v2/entries/en/','5815piXPUQ','\x0a\x0a🔗\x20*Synonyms*:\x20'];_0x3387=function(){return _0x377678;};return _0x3387();}
