//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

███╗░░░███╗██████╗░
████╗░████║██╔══██╗
██╔████╔██║██║░░██║
██║╚██╔╝██║██║░░██║
██║░╚═╝░██║██████╔╝
╚═╝░░░░░╚═╝╚═════╝░

██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

░█████╗░██╗░░░██╗
██╔═══╝░██║░░░██║
██████╗░╚██╗░██╔╝
██╔══██╗░╚████╔╝░
╚█████╔╝░░╚██╔╝░░
░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x23e6c3=_0x3048;(function(_0x23128f,_0x1e5424){const _0x5c39bc=_0x3048,_0x1a6f33=_0x23128f();while(!![]){try{const _0x31bbd3=-parseInt(_0x5c39bc(0x156))/0x1+-parseInt(_0x5c39bc(0x15b))/0x2+parseInt(_0x5c39bc(0x159))/0x3*(parseInt(_0x5c39bc(0x15c))/0x4)+-parseInt(_0x5c39bc(0x151))/0x5*(parseInt(_0x5c39bc(0x14c))/0x6)+parseInt(_0x5c39bc(0x155))/0x7*(parseInt(_0x5c39bc(0x150))/0x8)+parseInt(_0x5c39bc(0x158))/0x9*(-parseInt(_0x5c39bc(0x14e))/0xa)+parseInt(_0x5c39bc(0x15a))/0xb;if(_0x31bbd3===_0x1e5424)break;else _0x1a6f33['push'](_0x1a6f33['shift']());}catch(_0xdabcb8){_0x1a6f33['push'](_0x1a6f33['shift']());}}}(_0x4a95,0x3d677));const axios=require('axios'),{cmd,commands}=require('../command');function _0x3048(_0x849cfe,_0x6adb6c){const _0x4a9599=_0x4a95();return _0x3048=function(_0x3048f7,_0x4d56a2){_0x3048f7=_0x3048f7-0x14a;let _0x1283b2=_0x4a9599[_0x3048f7];return _0x1283b2;},_0x3048(_0x849cfe,_0x6adb6c);}function _0x4a95(){const _0x22e740=['1062219mExbUM','4803502NkHgFg','701132vnVPHC','4LTwVeo','get','sendMessage','58980SBzrXg','https://dog.ceo/api/breeds/image/random','10UunDtv','data','32krfRWx','55SRmLpY','Fetch\x20a\x20random\x20dog\x20image.','fun','єяяσя\x20ƒєт¢нιηg\x20∂σg\x20ιмαgє:\x20','715946CpYgUd','175006qXgUow','message','2831886eRRxSN'];_0x4a95=function(){return _0x22e740;};return _0x4a95();}cmd({'pattern':'dog','desc':_0x23e6c3(0x152),'category':_0x23e6c3(0x153),'react':'🐶','filename':__filename},async(_0x5e4e62,_0x52f5cc,_0x16b5cc,{from:_0x491c40,quoted:_0x1f9083,body:_0x31110b,isCmd:_0x3fb6d4,command:_0x35b7ae,args:_0x3e2aaf,q:_0x2eeb62,isGroup:_0x33431a,sender:_0x48e19b,senderNumber:_0x4eab19,botNumber2:_0x5b782c,botNumber:_0x5a73df,pushname:_0x1805c5,isMe:_0x419dce,isOwner:_0x10ed2d,groupMetadata:_0x3c2ba8,groupName:_0x224c10,participants:_0x19b58e,groupAdmins:_0x3e53d2,isBotAdmins:_0x218a5c,isAdmins:_0x6dd0c8,reply:_0x4ee880})=>{const _0x93fadd=_0x23e6c3;try{const _0x31e9d0=_0x93fadd(0x14d),_0x45e8c4=await axios[_0x93fadd(0x14a)](_0x31e9d0),_0x3cf3b2=_0x45e8c4[_0x93fadd(0x14f)];await _0x5e4e62[_0x93fadd(0x14b)](_0x491c40,{'image':{'url':_0x3cf3b2['message']},'caption':'🐶\x20SHADOW\x20MD\x20BY\x20OWNER🐶\x0a>\x20👨‍🚀🚀💗'},{'quoted':_0x52f5cc});}catch(_0x4ae412){console['log'](_0x4ae412),_0x4ee880(_0x93fadd(0x154)+_0x4ae412[_0x93fadd(0x157)]);}});
