//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

███╗░░░███╗██████╗░
████╗░████║██╔══██╗
██╔████╔██║██║░░██║
██║╚██╔╝██║██║░░██║
██║░╚═╝░██║██████╔╝
╚═╝░░░░░╚═╝╚═════╝░

██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

░█████╗░██╗░░░██╗
██╔═══╝░██║░░░██║
██████╗░╚██╗░██╔╝
██╔══██╗░╚████╔╝░
╚█████╔╝░░╚██╔╝░░
░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x4b5d76=_0x32d7;(function(_0x150cf2,_0x41823e){const _0x147be1=_0x32d7,_0x244350=_0x150cf2();while(!![]){try{const _0x4a5d46=parseInt(_0x147be1(0x75))/0x1+-parseInt(_0x147be1(0x81))/0x2+-parseInt(_0x147be1(0x78))/0x3*(-parseInt(_0x147be1(0x7d))/0x4)+parseInt(_0x147be1(0x7b))/0x5*(parseInt(_0x147be1(0x87))/0x6)+-parseInt(_0x147be1(0x85))/0x7*(parseInt(_0x147be1(0x84))/0x8)+-parseInt(_0x147be1(0x7c))/0x9*(parseInt(_0x147be1(0x79))/0xa)+parseInt(_0x147be1(0x88))/0xb;if(_0x4a5d46===_0x41823e)break;else _0x244350['push'](_0x244350['shift']());}catch(_0x574209){_0x244350['push'](_0x244350['shift']());}}}(_0x357c,0x24510));const axios=require('axios'),{cmd}=require(_0x4b5d76(0x7a));function _0x32d7(_0x594dfd,_0x4503de){const _0x357c56=_0x357c();return _0x32d7=function(_0x32d731,_0x8e3854){_0x32d731=_0x32d731-0x73;let _0x5c7cff=_0x357c56[_0x32d731];return _0x5c7cff;},_0x32d7(_0x594dfd,_0x4503de);}function _0x357c(){const _0x43d47e=['\x0a\x0aIsn\x27t\x20that\x20interesting?\x20😄\x0a\x0a','text','27NHYLxt','290IBhSUU','../command','5GkFwdi','64593cSBFHA','63780UvPuwk','⚠️\x20αη\x20єяяσя\x20σ¢¢υяяє∂\x20ωнιℓє\x20ƒєт¢нιηg\x20α\x20ƒυη\x20ƒα¢т.\x20ρℓєαѕє\x20тяу\x20αgαιη\x20ℓαтєя.','fact','\x0a\x0a👾\x20*ʀᴀɴᴅᴏᴍ\x20ꜰᴜɴ\x20ꜰᴀᴄᴛ*\x20👾\x0a\x0a','130476IdjGlR','fun','https://uselessfacts.jsph.pl/random.json?language=en','232HFqoUq','66857HTOJpM','data','51888MzVCoV','4932422YCwxkv','🧠\x20Get\x20a\x20random\x20fun\x20fact','get','98547BPSnZe'];_0x357c=function(){return _0x43d47e;};return _0x357c();}cmd({'pattern':_0x4b5d76(0x7f),'desc':_0x4b5d76(0x73),'react':'😝','category':_0x4b5d76(0x82),'filename':__filename},async(_0x550939,_0x531612,_0x1ac061,{from:_0x42ae03,q:_0x3b66bd,reply:_0x2fac00})=>{const _0x2eec33=_0x4b5d76;try{const _0x3632c2=_0x2eec33(0x83),_0x626a98=await axios[_0x2eec33(0x74)](_0x3632c2),_0x2e7aa2=_0x626a98[_0x2eec33(0x86)][_0x2eec33(0x77)],_0x579550=_0x2eec33(0x80)+_0x2e7aa2+_0x2eec33(0x76);return _0x2fac00(_0x579550);}catch(_0x54c8e1){return console['log'](_0x54c8e1),_0x2fac00(_0x2eec33(0x7e));}});
