//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x5a7d98=_0x2faa;function _0x41f5(){const _0xea7d93=['34793750mPBVPO','location','Unknown','data','../config','axios','3hMVfTa',')\x0a\x0a📝\x20*ʙɪᴏ*:\x20','followers','\x0a\x0a🔭\x20*ᴘᴜʙʟɪᴄ\x20ɢɪꜱᴛꜱ*:\x20','response','Fetch\x20detailed\x20GitHub\x20user\x20profile\x20including\x20profile\x20picture.','398078dRqexP','bio','other','7LXirTE','https://api.github.com/users/','Please\x20provide\x20a\x20GitHub\x20username.','name','👨‍💻𝗦𝗛𝗔𝗗𝗢𝗪\x20-\x20𝗠𝗗\x20-\x20𝗚𝗜𝗧𝗛𝗦𝗧𝗘𝗟𝗞👨‍💻\x0a\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x0a\x0a👤\x20*ᴜꜱᴇʀ\x20ɴᴀᴍᴇ*:\x20','7005978NlRyhc','\x0a\x0a👥\x20*ꜰᴏʟʟᴏᴡᴇʀꜱ*:\x20','\x0a\x0a🏙️\x20*ʟᴏᴄᴀᴛɪᴏɴ*:\x20','\x0a\x0a📅\x20*ᴄʀᴇᴀᴛʀᴅ\x20ᴅᴀᴛᴇ*:\x20','public_repos','Not\x20available','11263293GlSPum','avatar_url','1181817LUspNr','55028ykAVqO','\x20|\x20Following:\x20','\x0a\x0a📊\x20*ᴘᴜʙʟɪᴄ\x20ʀᴇᴘᴏ*:\x20','\x0a\x0a🔗\x20*ɢɪᴛʜᴜʙ\x20ᴜʀʟ*:(','9443944CMuQsy','message','645DtdAtn','following','html_url','toDateString','created_at','login','../command'];_0x41f5=function(){return _0xea7d93;};return _0x41f5();}(function(_0x5376b6,_0x1cf501){const _0x211e6f=_0x2faa,_0x55c65c=_0x5376b6();while(!![]){try{const _0x4e39b9=-parseInt(_0x211e6f(0x1ce))/0x1+parseInt(_0x211e6f(0x1be))/0x2*(parseInt(_0x211e6f(0x1b8))/0x3)+-parseInt(_0x211e6f(0x1cf))/0x4*(-parseInt(_0x211e6f(0x1d5))/0x5)+parseInt(_0x211e6f(0x1c6))/0x6+-parseInt(_0x211e6f(0x1c1))/0x7*(-parseInt(_0x211e6f(0x1d3))/0x8)+parseInt(_0x211e6f(0x1cc))/0x9+-parseInt(_0x211e6f(0x1b2))/0xa;if(_0x4e39b9===_0x1cf501)break;else _0x55c65c['push'](_0x55c65c['shift']());}catch(_0xd1b69c){_0x55c65c['push'](_0x55c65c['shift']());}}}(_0x41f5,0xdeb05));function _0x2faa(_0x4d8412,_0x143f1f){const _0x41f547=_0x41f5();return _0x2faa=function(_0x2faae7,_0x1eea6c){_0x2faae7=_0x2faae7-0x1ae;let _0x2cda91=_0x41f547[_0x2faae7];return _0x2cda91;},_0x2faa(_0x4d8412,_0x143f1f);}const axios=require(_0x5a7d98(0x1b7)),config=require(_0x5a7d98(0x1b6)),{cmd,commands}=require(_0x5a7d98(0x1b1));cmd({'pattern':'githubstalk','desc':_0x5a7d98(0x1bd),'category':_0x5a7d98(0x1c0),'react':'📚','filename':__filename},async(_0xae2ec9,_0x47d802,_0x4f2991,{from:_0x431b72,quoted:_0x27b4d3,body:_0x47dfe2,isCmd:_0x4759af,command:_0x42b78b,args:_0x12418a,q:_0x14912b,isGroup:_0x3cf6d5,sender:_0x35c958,senderNumber:_0x4268f8,botNumber2:_0x2a9a86,botNumber:_0x478d70,pushname:_0x2ddca2,isMe:_0x626794,isOwner:_0x22aab7,groupMetadata:_0x19513b,groupName:_0x395a46,participants:_0x560312,groupAdmins:_0x4a6b13,isBotAdmins:_0x56ce,isAdmins:_0x38189a,reply:_0x5c57f7})=>{const _0x117791=_0x5a7d98;try{const _0x4f15bb=_0x12418a[0x0];if(!_0x4f15bb)return _0x5c57f7(_0x117791(0x1c3));const _0x160157=_0x117791(0x1c2)+_0x4f15bb,_0x467c98=await axios['get'](_0x160157),_0x1672e2=_0x467c98[_0x117791(0x1b5)];let _0x55ec6b=_0x117791(0x1c5)+(_0x1672e2[_0x117791(0x1c4)]||_0x1672e2[_0x117791(0x1b0)])+_0x117791(0x1d2)+_0x1672e2[_0x117791(0x1d7)]+_0x117791(0x1b9)+(_0x1672e2[_0x117791(0x1bf)]||_0x117791(0x1cb))+_0x117791(0x1c8)+(_0x1672e2[_0x117791(0x1b3)]||_0x117791(0x1b4))+_0x117791(0x1d1)+_0x1672e2[_0x117791(0x1ca)]+_0x117791(0x1c7)+_0x1672e2[_0x117791(0x1ba)]+_0x117791(0x1d0)+_0x1672e2[_0x117791(0x1d6)]+_0x117791(0x1c9)+new Date(_0x1672e2[_0x117791(0x1af)])[_0x117791(0x1ae)]()+_0x117791(0x1bb)+_0x1672e2['public_gists']+'\x0a\x0a>\x20🚀\x20ꜱʜᴀᴅᴏᴡ\x20ᴏᴡɴᴇʀ\x20ʙʏ\x20ʟᴀᴋꜱʜᴀɴ\x20ᴛᴄ\x20ᴛᴇᴀᴍ\x0a\x0a';await _0xae2ec9['sendMessage'](_0x431b72,{'image':{'url':_0x1672e2[_0x117791(0x1cd)]},'caption':_0x55ec6b},{'quoted':_0x47d802});}catch(_0x1c6060){console['log'](_0x1c6060),_0x5c57f7('єяяσя\x20ƒєт¢нιηg\x20∂αтα:\x20'+(_0x1c6060[_0x117791(0x1bc)]?_0x1c6060['response']['data'][_0x117791(0x1d4)]:_0x1c6060[_0x117791(0x1d4)]));}});
