//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x4c8721=_0x5ba9;(function(_0x24c3a2,_0x70d00d){const _0x354329=_0x5ba9,_0x1ce137=_0x24c3a2();while(!![]){try{const _0x76455=-parseInt(_0x354329(0xad))/0x1+parseInt(_0x354329(0xb3))/0x2+parseInt(_0x354329(0xa9))/0x3*(-parseInt(_0x354329(0xaa))/0x4)+-parseInt(_0x354329(0xb0))/0x5*(parseInt(_0x354329(0xa8))/0x6)+-parseInt(_0x354329(0xa7))/0x7+-parseInt(_0x354329(0xa6))/0x8*(-parseInt(_0x354329(0xab))/0x9)+parseInt(_0x354329(0xb1))/0xa;if(_0x76455===_0x70d00d)break;else _0x1ce137['push'](_0x1ce137['shift']());}catch(_0x3a5069){_0x1ce137['push'](_0x1ce137['shift']());}}}(_0x5742,0xd7ef6));const crypto=require('crypto'),{cmd}=require(_0x4c8721(0xaf));function _0x5ba9(_0x3d7377,_0x1702cc){const _0x574218=_0x5742();return _0x5ba9=function(_0x5ba965,_0x3c773f){_0x5ba965=_0x5ba965-0xa6;let _0x2c77c7=_0x574218[_0x5ba965];return _0x2c77c7;},_0x5ba9(_0x3d7377,_0x1702cc);}function _0x5742(){const _0x332087=['abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789!@#$%^&*()_+[]{}|;:,.<>?','../command','385IaRmRo','17950110dAXNaL','gpass','1010510dbjUjP','log','🔐\x20*Your\x20Strong\x20Password*\x20🔐\x0a\x0aPlease\x20find\x20your\x20generated\x20password\x20below:\x0a\x0a>\x20>\x20❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣','sendMessage','randomInt','ρℓєαѕє\x20ρяσνι∂є\x20α\x20ναℓι∂\x20ℓєηgтн\x20ƒσя\x20тнє\x20ραѕѕωσя∂\x20(мιηιмυм\x208\x20¢нαяα¢тєяѕ).','136tZHFnU','5225766bLnQFa','30630fqZjjw','129GUOqjR','31932QijcsZ','268803sphxFo','other','440643LZmfsk'];_0x5742=function(){return _0x332087;};return _0x5742();}cmd({'pattern':_0x4c8721(0xb2),'desc':'Generate\x20a\x20strong\x20password.','category':_0x4c8721(0xac),'react':'🔐','filename':__filename},async(_0x10abe5,_0x4ae4c8,_0x43584b,{from:_0x22355d,quoted:_0x5c79fa,body:_0x393052,isCmd:_0xfe077a,command:_0x5d157c,args:_0x5b3b48,q:_0x34a310,isGroup:_0x3af29d,sender:_0x3d2af9,senderNumber:_0x1328d7,botNumber2:_0x4c593a,botNumber:_0x3cc418,pushname:_0x373bd3,isMe:_0x39b980,isOwner:_0x397c62,groupMetadata:_0x83a7ca,groupName:_0x5946dc,participants:_0x403da7,groupAdmins:_0x620f3b,isBotAdmins:_0x3748da,isAdmins:_0xb211a,reply:_0x3b2fa1})=>{const _0x2dfaf0=_0x4c8721;try{const _0x4a8a42=_0x5b3b48[0x0]?parseInt(_0x5b3b48[0x0]):0xc;if(isNaN(_0x4a8a42)||_0x4a8a42<0x8)return _0x3b2fa1(_0x2dfaf0(0xb8));const _0x52ff69=_0x305988=>{const _0x585bb5=_0x2dfaf0,_0x38842f=_0x585bb5(0xae);let _0xf13b56='';for(let _0x33b9be=0x0;_0x33b9be<_0x305988;_0x33b9be++){const _0x3e59b8=crypto[_0x585bb5(0xb7)](0x0,_0x38842f['length']);_0xf13b56+=_0x38842f[_0x3e59b8];}return _0xf13b56;},_0x3047c1=_0x52ff69(_0x4a8a42),_0x3c9ac7=_0x2dfaf0(0xb5);await _0x10abe5[_0x2dfaf0(0xb6)](_0x22355d,{'text':_0x3c9ac7},{'quoted':_0x4ae4c8}),await _0x10abe5[_0x2dfaf0(0xb6)](_0x22355d,{'text':_0x3047c1},{'quoted':_0x4ae4c8});}catch(_0x131fe7){console[_0x2dfaf0(0xb4)](_0x131fe7),_0x3b2fa1('❌\x20єяяσя\x20gєηєяαтιηg\x20ραѕѕωσя∂:\x20'+_0x131fe7['message']);}});
