//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

function _0x58f6(){const _0x58edea=['1455230eUFbVq','216UfUEXM','This\x20group\x20is\x20not\x20a\x20premium\x20group.','This\x20group\x20is\x20not\x20in\x20the\x20premium\x20list.','916018etVrMw','owner','1684bwghCX','6XzZkUp','premium','../config','This\x20group\x20has\x20been\x20removed\x20from\x20the\x20premium\x20list.','Only\x20owner\x20can\x20add\x20premium\x20groups.\x0aContact\x20Owner\x20+94767910958','171520oxCPKY','2281424SbrvyI','.ispremium','includes','This\x20group\x20has\x20been\x20added\x20to\x20the\x20premium\x20list.','This\x20group\x20is\x20already\x20in\x20the\x20premium\x20list.','Check\x20if\x20this\x20group\x20is\x20a\x20premium\x20group','indexOf','.premium','from','This\x20group\x20is\x20a\x20premium\x20group.','push','Add\x20this\x20group\x20to\x20the\x20premium\x20list','5512129FaWKiQ','splice','exports','4264845YqKbST','.removepremium','participant','15650tkDhuL'];_0x58f6=function(){return _0x58edea;};return _0x58f6();}function _0x3473(_0x1cef7a,_0x55cfcd){const _0x58f657=_0x58f6();return _0x3473=function(_0x347320,_0x442270){_0x347320=_0x347320-0x87;let _0x7adf09=_0x58f657[_0x347320];return _0x7adf09;},_0x3473(_0x1cef7a,_0x55cfcd);}const _0x2c55f3=_0x3473;(function(_0x1a764b,_0x485806){const _0x5a3451=_0x3473,_0x5885d1=_0x1a764b();while(!![]){try{const _0x55857e=-parseInt(_0x5a3451(0x99))/0x1+-parseInt(_0x5a3451(0xa1))/0x2+-parseInt(_0x5a3451(0x91))/0x3+parseInt(_0x5a3451(0x9b))/0x4*(-parseInt(_0x5a3451(0x94))/0x5)+parseInt(_0x5a3451(0x9c))/0x6*(parseInt(_0x5a3451(0x8e))/0x7)+parseInt(_0x5a3451(0xa2))/0x8+-parseInt(_0x5a3451(0x96))/0x9*(-parseInt(_0x5a3451(0x95))/0xa);if(_0x55857e===_0x485806)break;else _0x5885d1['push'](_0x5885d1['shift']());}catch(_0x529f3b){_0x5885d1['push'](_0x5885d1['shift']());}}}(_0x58f6,0xc92f6));const config=require(_0x2c55f3(0x9e)),{cmd,commands}=require('../command'),premiumGroups=[];cmd({'pattern':_0x2c55f3(0x9d),'desc':_0x2c55f3(0x8d),'use':_0x2c55f3(0x89),'react':'💡','category':_0x2c55f3(0x9a),'filename':__filename},async(_0x37ac8a,_0x8f3f62,_0x3ca6c3,{from:_0x107730,quoted:_0x59479b,body:_0x41b11d,q:_0x300010,reply:_0x35347f})=>{const _0x26ac9d=_0x2c55f3,_0x33278b=_0x3ca6c3[_0x26ac9d(0x93)]===_0x8f3f62[_0x26ac9d(0x8a)];if(!_0x33278b)return _0x35347f(_0x26ac9d(0xa0));!premiumGroups[_0x26ac9d(0xa4)](_0x107730)?(premiumGroups[_0x26ac9d(0x8c)](_0x107730),_0x35347f(_0x26ac9d(0xa5))):_0x35347f(_0x26ac9d(0xa6));}),cmd({'pattern':'removepremium','desc':'Remove\x20this\x20group\x20from\x20the\x20premium\x20list','use':_0x2c55f3(0x92),'react':'❌','category':_0x2c55f3(0x9a),'filename':__filename},async(_0x4ce63b,_0x48015b,_0x285289,{from:_0x4af430,quoted:_0x10b219,body:_0x537805,q:_0x40775d,reply:_0x2f0ab5})=>{const _0x2e5ef1=_0x2c55f3,_0x55fa0d=_0x285289['participant']===_0x48015b[_0x2e5ef1(0x8a)];if(!_0x55fa0d)return _0x2f0ab5('Only\x20admins\x20can\x20remove\x20premium\x20groups.');const _0x201905=premiumGroups[_0x2e5ef1(0x88)](_0x4af430);_0x201905>-0x1?(premiumGroups[_0x2e5ef1(0x8f)](_0x201905,0x1),_0x2f0ab5(_0x2e5ef1(0x9f))):_0x2f0ab5(_0x2e5ef1(0x98));}),cmd({'pattern':'ispremium','desc':_0x2c55f3(0x87),'use':_0x2c55f3(0xa3),'react':'🤖','category':'owner','filename':__filename},async(_0x53cbcc,_0xf58431,_0x399c0a,{from:_0x79d422,quoted:_0x52d58a,body:_0x2fbdbd,q:_0x2dd89b,reply:_0x55e489})=>{const _0x5cfcf7=_0x2c55f3;premiumGroups[_0x5cfcf7(0xa4)](_0x79d422)?_0x55e489(_0x5cfcf7(0x8b)):_0x55e489(_0x5cfcf7(0x97));}),module[_0x2c55f3(0x90)]={'premiumGroups':premiumGroups};
