//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x5e52b2=_0x20f9;function _0x20f9(_0x49a330,_0x1b04d1){const _0xee500e=_0xee50();return _0x20f9=function(_0x20f9ad,_0x455d52){_0x20f9ad=_0x20f9ad-0x85;let _0x531664=_0xee500e[_0x20f9ad];return _0x531664;},_0x20f9(_0x49a330,_0x1b04d1);}function _0xee50(){const _0x49c3cb=['>\x20*YOUR\x20DATA\x20FILE\x20SHADOW\x20MD\x20OWNER\x20TRANSER\x20DONE\x20🚀☣*','```[✚✚✚✚✚✚✚✚✚✚]\x2010%```\x20⏳','4926860ClfyXx','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x2020%```\x20⏳','sendMessage','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x2030%```\x20⏳','💻\x20*HACK\x20STARTING\x20SHADOW\x20MD..*\x20💻','9IptMxd','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x2060%```\x20⏳','9002600DmioAj','Displays\x20a\x20dynamic\x20and\x20playful\x20\x27Hacking\x27\x20message\x20for\x20fun.','7QzsoCW','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x2050%```\x20⏳','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x2080%```\x20⏳','2QYHMSb','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x2040%```\x20⏳','*📡\x20Transmitting\x20data...*\x20📤','21CuoVaP','🔒\x20*System\x20Breach:\x20Successful!*\x20🔓','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x20100%```\x20✅','5845352xgbCeS','143377fwHUNt','642856ZRdfbK','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x2090%```\x20⏳','14853Dvlnrk','132gaGrXB','131351ZCeczf','406wHCPJa','```[✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚✚]\x2070%```\x20⏳','⚠️\x20*Note:*\x20All\x20actions\x20are\x20for\x20demonstration\x20purposes\x20only.','🚀\x20*Command\x20Execution:\x20Complete!*\x20🎯','log','hack','*Connecting\x20to\x20remote\x20servers...*\x20🌐','6vOraMG'];_0xee50=function(){return _0x49c3cb;};return _0xee50();}(function(_0x156a07,_0x2b90b5){const _0x1d47e3=_0x20f9,_0x9f596b=_0x156a07();while(!![]){try{const _0x485657=-parseInt(_0x1d47e3(0x85))/0x1*(parseInt(_0x1d47e3(0x9e))/0x2)+-parseInt(_0x1d47e3(0xa1))/0x3*(-parseInt(_0x1d47e3(0xa6))/0x4)+-parseInt(_0x1d47e3(0x92))/0x5*(parseInt(_0x1d47e3(0x8f))/0x6)+-parseInt(_0x1d47e3(0x9b))/0x7*(parseInt(_0x1d47e3(0xa4))/0x8)+-parseInt(_0x1d47e3(0x97))/0x9*(-parseInt(_0x1d47e3(0x99))/0xa)+parseInt(_0x1d47e3(0x87))/0xb*(parseInt(_0x1d47e3(0x86))/0xc)+parseInt(_0x1d47e3(0xa5))/0xd*(parseInt(_0x1d47e3(0x88))/0xe);if(_0x485657===_0x2b90b5)break;else _0x9f596b['push'](_0x9f596b['shift']());}catch(_0x36a9e0){_0x9f596b['push'](_0x9f596b['shift']());}}}(_0xee50,0xb6054));const {cmd}=require('../command');cmd({'pattern':_0x5e52b2(0x8d),'desc':_0x5e52b2(0x9a),'category':'fun','react':'💻','filename':__filename},async(_0x2b1f73,_0x267437,_0x50136b,{from:_0x13749f,quoted:_0x336841,body:_0x3439bb,isCmd:_0x5c8a94,command:_0x31acc0,args:_0x283d5a,q:_0x563b8a,isGroup:_0x4fb931,sender:_0x140335,senderNumber:_0x39b18e,botNumber2:_0x1a0def,botNumber:_0x210ca1,pushname:_0x3f1d8e,isMe:_0x2922ef,isOwner:_0x6e062c,groupMetadata:_0x1a63d0,groupName:_0x4f4a45,participants:_0x25bc8f,groupAdmins:_0x46798c,isBotAdmins:_0xb0a345,isAdmins:_0x3e04f4,reply:_0x341b92})=>{const _0x25de22=_0x5e52b2;try{const _0x4842c1=[_0x25de22(0x96),'','*Initializing\x20hacking\x20tools...*\x20🛠️',_0x25de22(0x8e),'',_0x25de22(0x91),_0x25de22(0x93),_0x25de22(0x95),_0x25de22(0x9f),_0x25de22(0x9c),_0x25de22(0x98),_0x25de22(0x89),_0x25de22(0x9d),_0x25de22(0xa7),_0x25de22(0xa3),'',_0x25de22(0xa2),_0x25de22(0x8b),'',_0x25de22(0xa0),'_🕵️‍♂️\x20Ensuring\x20stealth..._\x20🤫','*🔧\x20Finalizing\x20operations...*\x20🏁','',_0x25de22(0x8a),'⚠️\x20*Reminder:*\x20Ethical\x20hacking\x20is\x20the\x20only\x20way\x20to\x20ensure\x20security.','',_0x25de22(0x90)];for(const _0x395e93 of _0x4842c1){await _0x2b1f73[_0x25de22(0x94)](_0x13749f,{'text':_0x395e93},{'quoted':_0x267437}),await new Promise(_0x41c1a1=>setTimeout(_0x41c1a1,0x3e8));}}catch(_0x140bd7){console[_0x25de22(0x8c)](_0x140bd7),_0x341b92('❌\x20*Error!*\x20'+_0x140bd7['message']);}});
