//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

███╗░░░███╗██████╗░
████╗░████║██╔══██╗
██╔████╔██║██║░░██║
██║╚██╔╝██║██║░░██║
██║░╚═╝░██║██████╔╝
╚═╝░░░░░╚═╝╚═════╝░

██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

░█████╗░██╗░░░██╗
██╔═══╝░██║░░░██║
██████╗░╚██╗░██╔╝
██╔══██╗░╚████╔╝░
╚█████╔╝░░╚██╔╝░░
░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x497909=_0x5da7;(function(_0x13e3eb,_0xded4cf){const _0x4db42a=_0x5da7,_0x2cdb12=_0x13e3eb();while(!![]){try{const _0x765831=-parseInt(_0x4db42a(0x134))/0x1*(parseInt(_0x4db42a(0x137))/0x2)+-parseInt(_0x4db42a(0x131))/0x3+-parseInt(_0x4db42a(0x12e))/0x4+parseInt(_0x4db42a(0x139))/0x5*(parseInt(_0x4db42a(0x12f))/0x6)+-parseInt(_0x4db42a(0x148))/0x7*(parseInt(_0x4db42a(0x141))/0x8)+-parseInt(_0x4db42a(0x136))/0x9*(-parseInt(_0x4db42a(0x14a))/0xa)+parseInt(_0x4db42a(0x145))/0xb;if(_0x765831===_0xded4cf)break;else _0x2cdb12['push'](_0x2cdb12['shift']());}catch(_0x57ef20){_0x2cdb12['push'](_0x2cdb12['shift']());}}}(_0x2746,0x6c60a));function _0x5da7(_0x4be54a,_0x267e66){const _0x27467a=_0x2746();return _0x5da7=function(_0x5da7bb,_0x19db6b){_0x5da7bb=_0x5da7bb-0x12e;let _0x5a15c0=_0x27467a[_0x5da7bb];return _0x5a15c0;},_0x5da7(_0x4be54a,_0x267e66);}const {cmd}=require('../command'),axios=require(_0x497909(0x135)),{Buffer}=require('buffer'),GOOGLE_API_KEY=_0x497909(0x13d),GOOGLE_CX='45b94c5cef39940d1';cmd({'pattern':_0x497909(0x146),'desc':_0x497909(0x13e),'react':'🖼️','category':_0x497909(0x13b),'filename':__filename},async(_0x3db1e5,_0xb404fb,_0x3ac29c,{from:_0x38970c,quoted:_0x39c1ce,body:_0x844275,isCmd:_0x5061c3,command:_0x59b8a0,args:_0x1b8635,q:_0x29b1eb,isGroup:_0x1dc3d4,sender:_0x1459f5,senderNumber:_0x4c01e9,botNumber2:_0xfc8d96,botNumber:_0x1d3161,pushname:_0x2fe4d6,isMe:_0x397dc9,isOwner:_0xe0b0e4,groupMetadata:_0xd4db78,groupName:_0x1fb74f,participants:_0x2a1088,groupAdmins:_0x73cbc4,isBotAdmins:_0x38f9f1,isAdmins:_0x312d2f,reply:_0xf8aa4f})=>{const _0x64cc10=_0x497909;try{if(!_0x29b1eb)return _0xf8aa4f('Please\x20provide\x20a\x20search\x20query\x20for\x20the\x20image\x20!!');const _0x308a93=encodeURIComponent(_0x29b1eb),_0x56f793=_0x64cc10(0x140)+_0x308a93+'&cx='+GOOGLE_CX+_0x64cc10(0x149)+GOOGLE_API_KEY+_0x64cc10(0x143),_0x2f341e=await axios[_0x64cc10(0x147)](_0x56f793),_0xdc58b4=_0x2f341e['data'];if(!_0xdc58b4['items']||_0xdc58b4['items'][_0x64cc10(0x142)]===0x0)return _0xf8aa4f(_0x64cc10(0x13c));for(let _0x38e67c=0x0;_0x38e67c<_0xdc58b4[_0x64cc10(0x144)][_0x64cc10(0x142)];_0x38e67c++){const _0x24a4a3=_0xdc58b4[_0x64cc10(0x144)][_0x38e67c][_0x64cc10(0x13f)],_0x3357a1=await axios[_0x64cc10(0x147)](_0x24a4a3,{'responseType':'arraybuffer'}),_0x178f8b=Buffer[_0x64cc10(0x130)](_0x3357a1[_0x64cc10(0x13a)],_0x64cc10(0x132));await _0x3db1e5['sendMessage'](_0x38970c,{'image':_0x178f8b,'caption':_0x64cc10(0x138)+(_0x38e67c+0x1)+'\x20from\x20your\x20search!*\x20👨‍💻\x0a\x0a\x20\x20\x20\x20\x20\x20\x20\x20*Enjoy\x20these\x20images!\x20📸*\x0a\x0a>\x20❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣\x0a\x0a'},{'quoted':_0xb404fb});}}catch(_0x291f3c){console[_0x64cc10(0x133)](_0x291f3c),_0xf8aa4f('Error:\x20'+_0x291f3c['message']);}});function _0x2746(){const _0x34ba4f=['&key=','10VAQjqs','2560652WEAZNC','6kHAbOp','from','2473164qVqIjM','binary','error','2akkzkQ','axios','3125421yKOhRQ','431144gTMceq','\x0a\x0a👨‍💻\x20*Image\x20','4008745CRFRfK','data','media','No\x20images\x20found\x20for\x20your\x20query.','AIzaSyDebFT-uY_f82_An6bnE9WvVcgVbzwDKgU','Search\x20and\x20send\x20images\x20from\x20Google.','link','https://www.googleapis.com/customsearch/v1?q=','938888nSQntP','length','&searchType=image&num=5','items','14387472vPkkjn','img','get','7FDnxLm'];_0x2746=function(){return _0x34ba4f;};return _0x2746();}
