//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
function _0x19cd(_0x54723b,_0x4f759f){const _0x5ae45b=_0x5ae4();return _0x19cd=function(_0x19cdc3,_0x220a92){_0x19cdc3=_0x19cdc3-0x7f;let _0x254666=_0x5ae45b[_0x19cdc3];return _0x254666;},_0x19cd(_0x54723b,_0x4f759f);}function _0x5ae4(){const _0x34111e=['2482616dabmFp','find','chat','*`ησ\x20∂αтα\x20ƒσυη∂.`*','video/mp4','resolution','5WERxOP','4167108hnEthH','*`ρℓєαѕє\x20gινє\x20α\x20ωαιℓ∂\x20ιηѕтαgяαм\x20ℓιηк`*','6872srxzpL','1569726ZPWbAJ','*`єяяσя\x20∂σωηℓσα∂\x20νι∂єσ.`*','78AmcYSw','3582yODqxD','url','1977018hBVNeV','>\x20❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣','download','log','762156bJWvsA','30vjYyLj','*`єяяσя\x20∂αтα\x20ℓσѕѕ.`*','7ZfLCPh','react','sendMessage','data','4977oMLnOe','To\x20download\x20instagram\x20videos.','2463szYnMf','360p\x20(SD)'];_0x5ae4=function(){return _0x34111e;};return _0x5ae4();}const _0x42cd4c=_0x19cd;(function(_0x358374,_0x57d0e3){const _0x52d8c8=_0x19cd,_0x571cf0=_0x358374();while(!![]){try{const _0x1c27b8=-parseInt(_0x52d8c8(0x90))/0x1+parseInt(_0x52d8c8(0x93))/0x2*(parseInt(_0x52d8c8(0x84))/0x3)+-parseInt(_0x52d8c8(0x86))/0x4*(parseInt(_0x52d8c8(0x8c))/0x5)+-parseInt(_0x52d8c8(0x95))/0x6*(parseInt(_0x52d8c8(0x9c))/0x7)+parseInt(_0x52d8c8(0x8f))/0x8*(parseInt(_0x52d8c8(0x82))/0x9)+-parseInt(_0x52d8c8(0x9a))/0xa*(-parseInt(_0x52d8c8(0x8d))/0xb)+parseInt(_0x52d8c8(0x99))/0xc*(parseInt(_0x52d8c8(0x92))/0xd);if(_0x1c27b8===_0x57d0e3)break;else _0x571cf0['push'](_0x571cf0['shift']());}catch(_0x5fe5a3){_0x571cf0['push'](_0x571cf0['shift']());}}}(_0x5ae4,0xe640d));const {cmd,commands}=require('../command');cmd({'pattern':'ig','desc':_0x42cd4c(0x83),'category':_0x42cd4c(0x97),'react':'🔎','filename':__filename},async(_0x1982c3,_0x4e6771,_0x1c1a0c,{from:_0x466b61,quoted:_0x47811d,body:_0x19fb8e,isCmd:_0xf1795b,command:_0x2bc495,args:_0x3090d7,q:_0x3efa,isGroup:_0x27acfb,sender:_0x5a38e9,senderNumber:_0x47cb7b,botNumber2:_0x496c87,botNumber:_0x57d368,pushname:_0x1632e3,isMe:_0x8179e8,isOwner:_0x5effa7,groupMetadata:_0x591619,groupName:_0x491339,participants:_0x14e3ac,groupAdmins:_0x476eef,isBotAdmins:_0x412a8a,isAdmins:_0x12fe33,reply:_0x2bbeeb})=>{const _0x5cc79f=_0x42cd4c;try{if(!_0x3090d7[0x0])return _0x2bbeeb(_0x5cc79f(0x8e));await _0x1c1a0c[_0x5cc79f(0x7f)]('📥');let _0x328220;try{_0x328220=await igdl(_0x3090d7[0x0]);}catch(_0x539317){return _0x2bbeeb('*`єяяσя\x20σвтαιηιηg\x20∂αтα.`*');}let _0x473f21=_0x328220[_0x5cc79f(0x81)];if(!_0x473f21||_0x473f21['length']===0x0)return _0x2bbeeb('*`ησ\x20яєѕυℓт\x20ƒσυη∂.`*');let _0xf9f791;try{_0xf9f791=_0x473f21[_0x5cc79f(0x87)](_0x18cabb=>_0x18cabb[_0x5cc79f(0x8b)]==='720p\x20(HD)')||_0x473f21[_0x5cc79f(0x87)](_0x2a4cbb=>_0x2a4cbb[_0x5cc79f(0x8b)]===_0x5cc79f(0x85));}catch(_0x27f989){return _0x2bbeeb(_0x5cc79f(0x9b));}if(!_0xf9f791)return _0x2bbeeb(_0x5cc79f(0x89));await _0x1c1a0c[_0x5cc79f(0x7f)]('⚡');let _0x4f4c7f=_0xf9f791[_0x5cc79f(0x94)],_0x2f02a1=_0x5cc79f(0x96);try{await _0x1982c3[_0x5cc79f(0x80)](_0x1c1a0c[_0x5cc79f(0x88)],{'video':{'url':_0x4f4c7f},'caption':_0x2f02a1,'fileName':'ig.mp4','mimetype':_0x5cc79f(0x8a)},{'quoted':_0x1c1a0c});}catch(_0x4ee2e0){return _0x2bbeeb(_0x5cc79f(0x91));await _0x1c1a0c['react']('❌');}}catch(_0x4a376f){console[_0x5cc79f(0x98)](_0x4a376f),_0x2bbeeb(''+_0x4a376f);}});
