//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x5c728c=_0x48dc;function _0x48dc(_0x1c26b3,_0x353a3c){const _0x29bd78=_0x29bd();return _0x48dc=function(_0x48dc7a,_0x690567){_0x48dc7a=_0x48dc7a-0x1bc;let _0x31a046=_0x29bd78[_0x48dc7a];return _0x31a046;},_0x48dc(_0x1c26b3,_0x353a3c);}function _0x29bd(){const _0x46bc94=['1431529jzHubk','120MuFjqv','3878322CcUvCN','8804160egHgPM','../command','\x20😄\x0a\x0a>\x20❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣\x20','\x0a\x0a😂\x20*Here\x27s\x20a\x20random\x20joke\x20for\x20you!*\x20😂\x0a\x0a*','get','296419jpNwES','data','9zLBshX','7132408eSTZCF','joke','180oWKpCy','30825cKwXMa','https://official-joke-api.appspot.com/random_joke','6bbbtVN','*\x0a\x0a','axios','5936915KaASTm'];_0x29bd=function(){return _0x46bc94;};return _0x29bd();}(function(_0x484666,_0x1e7492){const _0x4d99b8=_0x48dc,_0x80afee=_0x484666();while(!![]){try{const _0x209cda=parseInt(_0x4d99b8(0x1be))/0x1+parseInt(_0x4d99b8(0x1cb))/0x2*(parseInt(_0x4d99b8(0x1c4))/0x3)+parseInt(_0x4d99b8(0x1c1))/0x4+-parseInt(_0x4d99b8(0x1c9))/0x5*(-parseInt(_0x4d99b8(0x1c6))/0x6)+parseInt(_0x4d99b8(0x1cc))/0x7+-parseInt(_0x4d99b8(0x1cd))/0x8*(parseInt(_0x4d99b8(0x1c0))/0x9)+parseInt(_0x4d99b8(0x1c3))/0xa*(-parseInt(_0x4d99b8(0x1ca))/0xb);if(_0x209cda===_0x1e7492)break;else _0x80afee['push'](_0x80afee['shift']());}catch(_0x1a34ce){_0x80afee['push'](_0x80afee['shift']());}}}(_0x29bd,0xf2c7c));const axios=require(_0x5c728c(0x1c8)),{cmd}=require(_0x5c728c(0x1ce));cmd({'pattern':_0x5c728c(0x1c2),'desc':'😂\x20Get\x20a\x20random\x20joke','react':'😗','category':'fun','filename':__filename},async(_0x181a5f,_0x2c8965,_0x3fef66,{from:_0x12023f,q:_0x5a75dc,reply:_0x49da90})=>{const _0xf83c3b=_0x5c728c;try{const _0x1627d6=_0xf83c3b(0x1c5),_0x24b81e=await axios[_0xf83c3b(0x1bd)](_0x1627d6),_0x113dc0=_0x24b81e[_0xf83c3b(0x1bf)],_0x33d12b=_0xf83c3b(0x1bc)+_0x113dc0['setup']+_0xf83c3b(0x1c7)+_0x113dc0['punchline']+_0xf83c3b(0x1cf);return _0x49da90(_0x33d12b);}catch(_0x1bb567){return console['log'](_0x1bb567),_0x49da90('⚠️\x20¢συℓ∂η\x27т\x20ƒєт¢н\x20α\x20נσкє\x20яιgнт\x20ησω.\x20ρℓєαѕє\x20тяу\x20αgαιη\x20ℓαтєя.');}});
