//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

function _0x36b2(_0x66234e,_0x11f7b6){const _0x685b14=_0x685b();return _0x36b2=function(_0x36b228,_0x18f5ff){_0x36b228=_0x36b228-0x13f;let _0x764f3b=_0x685b14[_0x36b228];return _0x764f3b;},_0x36b2(_0x66234e,_0x11f7b6);}function _0x685b(){const _0x4d83a8=['https://newsapi.org/v2/top-headlines?country=us&apiKey=','../command','735978GRDyQC','url','3505825aDMpSi','1cASXIu','urlToImage','Article\x20URL:','_\x0a\x0a\x20\x20>\x20❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣\x0a\x0a\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20\x20','articles','5573736jKcijB','\x0a\x0a➣\x20📰\x20*','sendMessage','3984384xvMJSv','No\x20news\x20articles\x20found.','title','log','get','news','Could\x20not\x20fetch\x20news.\x20Please\x20try\x20again\x20later.','data','784eLSxrS','Error\x20fetching\x20news:','91998slAIQM','746316RJfukp','error','length','min','_\x0a\x0a➣\x20🔗\x20_','1495260CddEbN'];_0x685b=function(){return _0x4d83a8;};return _0x685b();}const _0x11980f=_0x36b2;(function(_0x21483a,_0x1841f9){const _0x1ae766=_0x36b2,_0x37ab31=_0x21483a();while(!![]){try{const _0x2834db=-parseInt(_0x1ae766(0x145))/0x1*(-parseInt(_0x1ae766(0x142))/0x2)+-parseInt(_0x1ae766(0x158))/0x3+parseInt(_0x1ae766(0x13f))/0x4+parseInt(_0x1ae766(0x144))/0x5+-parseInt(_0x1ae766(0x14d))/0x6+-parseInt(_0x1ae766(0x14a))/0x7+-parseInt(_0x1ae766(0x155))/0x8*(-parseInt(_0x1ae766(0x157))/0x9);if(_0x2834db===_0x1841f9)break;else _0x37ab31['push'](_0x37ab31['shift']());}catch(_0xb108be){_0x37ab31['push'](_0x37ab31['shift']());}}}(_0x685b,0xb3999));const axios=require('axios'),{cmd}=require(_0x11980f(0x141));cmd({'pattern':_0x11980f(0x152),'desc':'Get\x20the\x20latest\x20news\x20headlines.','category':_0x11980f(0x152),'react':'📌','filename':__filename},async(_0xf60cf7,_0x15bb75,_0x454e7e,{from:_0x28a187,reply:_0x418983})=>{const _0x1ecd80=_0x11980f;try{const _0x53db13='0f2c43ab11324578a7b1709651736382',_0x2cbe5c=await axios[_0x1ecd80(0x151)](_0x1ecd80(0x140)+_0x53db13),_0x6763cd=_0x2cbe5c[_0x1ecd80(0x154)][_0x1ecd80(0x149)];if(!_0x6763cd['length'])return _0x418983(_0x1ecd80(0x14e));for(let _0x3eb4d2=0x0;_0x3eb4d2<Math[_0x1ecd80(0x15b)](_0x6763cd[_0x1ecd80(0x15a)],0x5);_0x3eb4d2++){const _0x1ec26f=_0x6763cd[_0x3eb4d2];let _0x24d550=_0x1ecd80(0x14b)+_0x1ec26f[_0x1ecd80(0x14f)]+'*\x0a\x0a➣\x20⚠️\x20_'+_0x1ec26f['description']+_0x1ecd80(0x15c)+_0x1ec26f[_0x1ecd80(0x143)]+_0x1ecd80(0x148);console[_0x1ecd80(0x150)](_0x1ecd80(0x147),_0x1ec26f[_0x1ecd80(0x146)]),_0x1ec26f['urlToImage']?await _0xf60cf7[_0x1ecd80(0x14c)](_0x28a187,{'image':{'url':_0x1ec26f[_0x1ecd80(0x146)]},'caption':_0x24d550}):await _0xf60cf7['sendMessage'](_0x28a187,{'text':_0x24d550});};}catch(_0x1ef759){console[_0x1ecd80(0x159)](_0x1ecd80(0x156),_0x1ef759),_0x418983(_0x1ecd80(0x153));}});
