//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

const _0xc544f6=_0x27e4;(function(_0x3d2e9d,_0x207b4a){const _0x341ec8=_0x27e4,_0x581bc7=_0x3d2e9d();while(!![]){try{const _0x466b7b=parseInt(_0x341ec8(0x8c))/0x1+parseInt(_0x341ec8(0x8e))/0x2*(parseInt(_0x341ec8(0x91))/0x3)+-parseInt(_0x341ec8(0x85))/0x4+parseInt(_0x341ec8(0x94))/0x5+parseInt(_0x341ec8(0x81))/0x6+parseInt(_0x341ec8(0x84))/0x7+-parseInt(_0x341ec8(0x83))/0x8*(parseInt(_0x341ec8(0x8b))/0x9);if(_0x466b7b===_0x207b4a)break;else _0x581bc7['push'](_0x581bc7['shift']());}catch(_0x53a30a){_0x581bc7['push'](_0x581bc7['shift']());}}}(_0x473e,0xbe158));function _0x27e4(_0x259597,_0x95fe05){const _0x473eac=_0x473e();return _0x27e4=function(_0x27e44f,_0x18abd6){_0x27e44f=_0x27e44f-0x81;let _0x437ed6=_0x473eac[_0x27e44f];return _0x437ed6;},_0x27e4(_0x259597,_0x95fe05);}const {cmd,commands}=require(_0xc544f6(0x90));function _0x473e(){const _0xcad82b=['audio/mp4','746iJHRCw','log','../command','114MCIjeq','owner\x20the\x20bot','main','7707215uuTMtA','6392802cSIvvY','👨‍💻','1272icSKAh','2855482upYVTn','3151684mPyTcf','sendMessage','*👋\x20Hello\x20','https://i.imgur.com/j6U1bJq.jpeg','owner','*\x0a\x0a*❮❮\x20👨‍💻💭\x20Ｉ\x20ａｍ\x20\x20🫱🏻‍🫲🏻😻🤍*\x0a\x0a🔐❮❮\x20𝗦𝗛𝗔𝗗𝗢𝗪\x20𝗠𝗗\x20𝗠𝗔𝗜𝗡\x20𝗢𝗪𝗡𝗘𝗥\x20➤\x20🚀\x0a\x0a*❮ɪ\x20ᴀᴍ\x20-\x20𝚂𝙷𝙰𝙳𝙾𝚆\x20𝙼𝙳\x20👾🖤*\x0a\x0a*❮❮ᴍʏ\x20ʀᴇᴀʟ\x20ɴᴀᴍᴇ\x20-\x20𝙻𝚊𝚔𝚜𝚑𝚊𝚗\x20𝙳𝚊𝚖𝚊𝚢𝚊𝚗𝚝𝚑𝚊*🤴🏻🪄\x0a\x0a*❮❮ᴀɢᴇ\x20-\x20999+\x20😋🔥*\x0a\x0a*❮❮ᴍᴏʀᴇ\x20ᴅɪᴛᴇʟꜱ\x20-*\x20https://wa.me/+94767910958?text=_Hey÷ꜱʜᴀᴅᴏᴡ_ᴍᴅ_ʏᴏᴜ_ᴅɪᴛᴇʟꜱ_👨🏻‍💻👑📍\x0a\x0a>\x20*➣\x20ᴏᴡɴᴇʀ\x20:\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ*\x0a\x0a','148851BJDISt','1167196RoTeXq'];_0x473e=function(){return _0xcad82b;};return _0x473e();}cmd({'pattern':_0xc544f6(0x89),'desc':_0xc544f6(0x92),'category':_0xc544f6(0x93),'react':_0xc544f6(0x82),'filename':__filename},async(_0x253228,_0x2f9bd8,_0x35ba9b,{from:_0x2679bc,quoted:_0x249973,body:_0x4557e6,isCmd:_0x4e9838,command:_0x3c274f,args:_0x5d2e6b,q:_0x31d511,isGroup:_0x4d7c7d,sender:_0x578c54,senderNumber:_0x13c1fc,botNumber2:_0x3b73a9,botNumber:_0x1e5c2e,pushname:_0x51972e,isMe:_0x16cc1d,isOwner:_0x49dd83,groupMetadata:_0x503f39,groupName:_0xf238b1,participants:_0x432e56,groupAdmins:_0x2a844f,isBotAdmins:_0x555efc,isAdmins:_0x258db4,reply:_0x3ffe1a})=>{const _0xb8937c=_0xc544f6;try{let _0x4e2473=_0xb8937c(0x87)+_0x51972e+_0xb8937c(0x8a);await _0x253228['sendMessage'](_0x2679bc,{'image':{'url':_0xb8937c(0x88)},'caption':_0x4e2473},{'quoted':_0x2f9bd8}),await _0x253228[_0xb8937c(0x86)](_0x2679bc,{'audio':{'url':'https://github.com/Shadowteach/shadow-raw/raw/refs/heads/main/NEW%20V%206%20button%20owne.mp3'},'mimetype':_0xb8937c(0x8d),'ptt':!![]},{'quoted':_0x2f9bd8});}catch(_0x104f7b){console[_0xb8937c(0x8f)](_0x104f7b),_0x3ffe1a(''+_0x104f7b);}});
