//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
function _0x3bee(){const _0x2f5502=['539768rrSfNj','351678XUgagG','6903675XPhsTi','135oZFkYg','*👋\x20Hello\x20','7365228QClnZk','main','log','2252orXJRJ','1042rcEzSG','*\x0a\x0a*\x20🗿REPO\x20LINK\x20💡*\x0a\x0a🧙‍♂️\x20➤https://github.com/Shadowteach/SHADOW-MD.git\x0a\x0a*👾\x20➤\x20PLEASE\x20FOLLOW\x20MY\x20WHATSAPP\x20CHANNEL👇*\x0a\x0a💡\x20➤https://whatsapp.com/channel/0029Vajn0gb8F2pFh7PDqO0c\x0a\x0a*ꜱʜᴀᴅᴏᴡ\x20ᴍᴅ\x20ᴍᴀɪɴ\x20ᴏᴡɴᴇʀ\x20➤*\x0a\x0a','../command','5127288ifAdXH','repo','2955302LmDKhR','sendMessage','https://i.imgur.com/pJ5WluK.jpeg'];_0x3bee=function(){return _0x2f5502;};return _0x3bee();}const _0x154dcc=_0x5965;function _0x5965(_0x1c82c3,_0x25441f){const _0x3bee4a=_0x3bee();return _0x5965=function(_0x596520,_0x1dc95f){_0x596520=_0x596520-0xc4;let _0x50f073=_0x3bee4a[_0x596520];return _0x50f073;},_0x5965(_0x1c82c3,_0x25441f);}(function(_0x530204,_0x5b1222){const _0x406cda=_0x5965,_0x3117f8=_0x530204();while(!![]){try{const _0x4e46aa=-parseInt(_0x406cda(0xc6))/0x1*(-parseInt(_0x406cda(0xc7))/0x2)+parseInt(_0x406cda(0xd0))/0x3+-parseInt(_0x406cda(0xca))/0x4+parseInt(_0x406cda(0xd1))/0x5+-parseInt(_0x406cda(0xd4))/0x6+-parseInt(_0x406cda(0xcc))/0x7+parseInt(_0x406cda(0xcf))/0x8*(parseInt(_0x406cda(0xd2))/0x9);if(_0x4e46aa===_0x5b1222)break;else _0x3117f8['push'](_0x3117f8['shift']());}catch(_0x5b23e5){_0x3117f8['push'](_0x3117f8['shift']());}}}(_0x3bee,0xb789c));const {cmd,commands}=require(_0x154dcc(0xc9));cmd({'pattern':_0x154dcc(0xcb),'desc':'repo\x20the\x20bot','category':_0x154dcc(0xc4),'react':'🤗','filename':__filename},async(_0x3470ba,_0x309291,_0x469a0d,{from:_0x5e49f0,quoted:_0xb761fd,body:_0x1acd4b,isCmd:_0x1845df,command:_0x5044ea,args:_0xf60ff3,q:_0x13063e,isGroup:_0x29cc0b,sender:_0x5a7b7d,senderNumber:_0x3c1452,botNumber2:_0x56c279,botNumber:_0x4d270b,pushname:_0xce7250,isMe:_0x3b62b0,isOwner:_0x5464dd,groupMetadata:_0x289d7f,groupName:_0x251139,participants:_0x215c01,groupAdmins:_0x2801ea,isBotAdmins:_0x2552df,isAdmins:_0x33c9a7,reply:_0x15e06a})=>{const _0xd25db=_0x154dcc;try{let _0x31be6c=_0xd25db(0xd3)+_0xce7250+_0xd25db(0xc8);await _0x3470ba[_0xd25db(0xcd)](_0x5e49f0,{'image':{'url':_0xd25db(0xce)},'caption':_0x31be6c},{'quoted':_0x309291});}catch(_0xf71189){console[_0xd25db(0xc5)](_0xf71189),_0x15e06a(''+_0xf71189);}});
