//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

function _0x5306(){const _0x3deb5b=['54646bbNiiO','19949384slqPUk','8115646ZotWPg','../lib/functions','144hUmtmg','owner','../command','pm2\x20restart\x20all','195495RAsnak','2408396dkJfzX','log','4514592dEfKeu','restarting\x20shadow\x20md\x20bot..','restart','3323586ceMaRH'];_0x5306=function(){return _0x3deb5b;};return _0x5306();}const _0x28437a=_0x336a;(function(_0x34ddf1,_0x3ae8b1){const _0x232e42=_0x336a,_0x2cafe0=_0x34ddf1();while(!![]){try{const _0x3fde1f=-parseInt(_0x232e42(0x6b))/0x1+parseInt(_0x232e42(0x65))/0x2+parseInt(_0x232e42(0x6a))/0x3+parseInt(_0x232e42(0x67))/0x4+parseInt(_0x232e42(0x64))/0x5*(parseInt(_0x232e42(0x6f))/0x6)+-parseInt(_0x232e42(0x6d))/0x7+-parseInt(_0x232e42(0x6c))/0x8;if(_0x3fde1f===_0x3ae8b1)break;else _0x2cafe0['push'](_0x2cafe0['shift']());}catch(_0x1d6360){_0x2cafe0['push'](_0x2cafe0['shift']());}}}(_0x5306,0xa3e9b));function _0x336a(_0xc0d2aa,_0x32917c){const _0x53065a=_0x5306();return _0x336a=function(_0x336ae4,_0x30d087){_0x336ae4=_0x336ae4-0x64;let _0x323316=_0x53065a[_0x336ae4];return _0x323316;},_0x336a(_0xc0d2aa,_0x32917c);}const config=require('../config'),{cmd,commands}=require(_0x28437a(0x71)),{sleep}=require(_0x28437a(0x6e));cmd({'pattern':_0x28437a(0x69),'react':'👾','desc':'restart\x20the\x20bot','category':_0x28437a(0x70),'filename':__filename},async(_0x5143ba,_0x35f56e,_0x21bcf4,{from:_0x2d88a1,quoted:_0x2d9864,body:_0x51e764,isCmd:_0x130887,command:_0x43e33a,args:_0x56290b,q:_0x4c4e63,isGroup:_0x19326c,sender:_0x97a7e0,senderNumber:_0x2cc2fa,botNumber2:_0x3cca1d,botNumber:_0x3793e8,pushname:_0x22f3d4,isMe:_0x259550,isOwner:_0x3ebc46,groupMetadata:_0x50219f,groupName:_0x2558b6,participants:_0x4cb739,groupAdmins:_0x34c95b,isBotAdmins:_0x1d074a,isAdmins:_0x1e583c,reply:_0x5498e0})=>{const _0x1bedfb=_0x28437a;try{if(!_0x3ebc46)return;const {exec:_0x13062c}=require('child_process');_0x5498e0(_0x1bedfb(0x68)),await sleep(0x5dc),_0x13062c(_0x1bedfb(0x72));}catch(_0x5293fb){console[_0x1bedfb(0x66)](_0x5293fb),_0x5498e0(''+_0x5293fb);}});
