//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

const _0x3bd05d=_0x404e;(function(_0x27f480,_0x5249a7){const _0x3a1518=_0x404e,_0x3a96c7=_0x27f480();while(!![]){try{const _0x4fbb0e=parseInt(_0x3a1518(0xb0))/0x1*(-parseInt(_0x3a1518(0xb4))/0x2)+-parseInt(_0x3a1518(0xb2))/0x3*(parseInt(_0x3a1518(0xaa))/0x4)+parseInt(_0x3a1518(0xaf))/0x5+parseInt(_0x3a1518(0xae))/0x6*(-parseInt(_0x3a1518(0xb8))/0x7)+-parseInt(_0x3a1518(0xb7))/0x8+-parseInt(_0x3a1518(0xac))/0x9+parseInt(_0x3a1518(0xb3))/0xa*(parseInt(_0x3a1518(0xab))/0xb);if(_0x4fbb0e===_0x5249a7)break;else _0x3a96c7['push'](_0x3a96c7['shift']());}catch(_0x6e5a46){_0x3a96c7['push'](_0x3a96c7['shift']());}}}(_0x3de0,0xc1a9c));function _0x3de0(){const _0x51bc76=['112717KEloyY','check\x20up\x20time','14289ICQuBO','170ydjCQd','24DqQkdl','\x20*🚀\x20Runtime:-\x20\x20','uptime','7980984GYlruM','343sJgFXa','status','12IzJFmc','2518571cKbaNP','8148321TtIQWE','../lib/functions','33102ezkXCB','2205625easGzA'];_0x3de0=function(){return _0x51bc76;};return _0x3de0();}function _0x404e(_0x29d5c6,_0x40d205){const _0x3de00b=_0x3de0();return _0x404e=function(_0x404e62,_0xca52c1){_0x404e62=_0x404e62-0xaa;let _0x568624=_0x3de00b[_0x404e62];return _0x568624;},_0x404e(_0x29d5c6,_0x40d205);}const config=require('../config'),{cmd,commands}=require('../command'),{runtime}=require(_0x3bd05d(0xad));cmd({'pattern':'runtime','alias':[_0x3bd05d(0xb9),'botinfo'],'desc':_0x3bd05d(0xb1),'category':'main','react':'📡','filename':__filename},async(_0x12aaf2,_0x1794bc,_0xbc07ff,{from:_0x48e9aa,quoted:_0x47eb04,body:_0x4d6c61,isCmd:_0x5a2cca,command:_0x54f4a5,args:_0x2167f6,q:_0x99bcaa,isGroup:_0x54b179,sender:_0x55ea19,senderNumber:_0x36eae7,botNumber2:_0x33d5d1,botNumber:_0xb208c0,pushname:_0x4e6e09,isMe:_0x5241fa,isOwner:_0x34dc14,groupMetadata:_0x3ecc93,groupName:_0xde264e,participants:_0x5c4104,groupAdmins:_0x3b4f7b,isBotAdmins:_0xdeae30,isAdmins:_0x4296ee,reply:_0x1d9b7c})=>{const _0x1eb58a=_0x3bd05d;try{let _0x5a5984=_0x1eb58a(0xb5)+runtime(process[_0x1eb58a(0xb6)]())+'*\x20';return _0x1d9b7c(''+_0x5a5984);}catch(_0x11e2fd){console['log'](_0x11e2fd),_0x1d9b7c(''+_0x11e2fd);}});
