//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

const _0x18a263=_0x2332;(function(_0x2f6e66,_0x256eda){const _0x2f0a2f=_0x2332,_0x3b9b24=_0x2f6e66();while(!![]){try{const _0x315a09=-parseInt(_0x2f0a2f(0x1a1))/0x1*(-parseInt(_0x2f0a2f(0x1b3))/0x2)+-parseInt(_0x2f0a2f(0x1a8))/0x3*(-parseInt(_0x2f0a2f(0x1ae))/0x4)+parseInt(_0x2f0a2f(0x1a4))/0x5+-parseInt(_0x2f0a2f(0x1a6))/0x6+parseInt(_0x2f0a2f(0x1a3))/0x7*(-parseInt(_0x2f0a2f(0x19f))/0x8)+parseInt(_0x2f0a2f(0x1a9))/0x9*(parseInt(_0x2f0a2f(0x1ad))/0xa)+-parseInt(_0x2f0a2f(0x19b))/0xb*(parseInt(_0x2f0a2f(0x1b0))/0xc);if(_0x315a09===_0x256eda)break;else _0x3b9b24['push'](_0x3b9b24['shift']());}catch(_0x3af771){_0x3b9b24['push'](_0x3b9b24['shift']());}}}(_0x93f1,0xdde95));const {cmd}=require(_0x18a263(0x1ab)),config=require(_0x18a263(0x1b2));function _0x93f1(){const _0x52d9e4=['log','2107216bKYAUk','updateProfileStatus','464083mnuBsK','autoBioEnabled','28GjxJSZ','7531280TXmDyj','❌\x20You\x20are\x20not\x20the\x20owner!','4404408TOBrAI','toLocaleTimeString','3VWZdQL','358497qHTSGK','👨‍💻\x20SHADOW-MD\x20[','../command','⚒️\x20AutoBIO\x20feature\x20has\x20been\x20*enabled*!\x20🔄','70lconxC','5901612IZhegG','⚒️\x20AutoBIO\x20feature\x20has\x20been\x20*disabled*!\x20🚫','35892RjcznY','owner','../config','6HSxkfR','7194ziAuyx','⚒️\x20AutoBIO\x20feature\x20stopped.','Enable\x20or\x20disable\x20the\x20AutoBIO\x20feature.'];_0x93f1=function(){return _0x52d9e4;};return _0x93f1();}function _0x2332(_0x36841f,_0x505828){const _0x93f1ff=_0x93f1();return _0x2332=function(_0x233219,_0x407749){_0x233219=_0x233219-0x19b;let _0x48752b=_0x93f1ff[_0x233219];return _0x48752b;},_0x2332(_0x36841f,_0x505828);}let autoBioInterval;cmd({'pattern':'setautobio','desc':_0x18a263(0x19d),'category':_0x18a263(0x1b1),'react':'⚒️','filename':__filename},async(_0x5d2cb7,_0x5910e0,_0x4177ac,{from:_0x4c73ee,isOwner:_0x1dd8e9,reply:_0x1e745e})=>{const _0x4e258a=_0x18a263;if(!_0x1dd8e9)return _0x1e745e(_0x4e258a(0x1a5));config[_0x4e258a(0x1a2)]=!config['autoBioEnabled'],config['autoBioEnabled']?(_0x1e745e(_0x4e258a(0x1ac)),startAutoBio(_0x5d2cb7)):(_0x1e745e(_0x4e258a(0x1af)),stopAutoBio());});function startAutoBio(_0xd93790){if(autoBioInterval)clearInterval(autoBioInterval);autoBioInterval=setInterval(async()=>{const _0x5e7ed5=_0x2332,_0x23ddaf=new Date()[_0x5e7ed5(0x1a7)](),_0x169134=_0x5e7ed5(0x1aa)+_0x23ddaf+']\x20👨‍💻';await _0xd93790[_0x5e7ed5(0x1a0)](_0x169134);},0x3c*0x3e8);}function stopAutoBio(){const _0x5cbfbc=_0x18a263;autoBioInterval&&(clearInterval(autoBioInterval),autoBioInterval=null,console[_0x5cbfbc(0x19e)](_0x5cbfbc(0x19c)));}
