//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x7c537a=_0x4180;function _0x4180(_0x108e0a,_0x912bfd){const _0xab1220=_0xab12();return _0x4180=function(_0x418005,_0x565777){_0x418005=_0x418005-0x11e;let _0x4eccf3=_0xab1220[_0x418005];return _0x4eccf3;},_0x4180(_0x108e0a,_0x912bfd);}(function(_0x4da63a,_0xd65dae){const _0x1c54b3=_0x4180,_0x4d7358=_0x4da63a();while(!![]){try{const _0x1dbb83=parseInt(_0x1c54b3(0x135))/0x1+parseInt(_0x1c54b3(0x126))/0x2+parseInt(_0x1c54b3(0x128))/0x3+-parseInt(_0x1c54b3(0x132))/0x4*(-parseInt(_0x1c54b3(0x139))/0x5)+parseInt(_0x1c54b3(0x136))/0x6+-parseInt(_0x1c54b3(0x12f))/0x7*(-parseInt(_0x1c54b3(0x120))/0x8)+-parseInt(_0x1c54b3(0x130))/0x9;if(_0x1dbb83===_0xd65dae)break;else _0x4d7358['push'](_0x4d7358['shift']());}catch(_0x311aa5){_0x4d7358['push'](_0x4d7358['shift']());}}}(_0xab12,0x6e41f));const axios=require(_0x7c537a(0x131)),{cmd,commands}=require(_0x7c537a(0x12b));function _0xab12(){const _0x1bc6e6=['name','data','stargazers_count','1376zTAdXP','https://api.github.com/repos/','🍴\x20*ꜰᴏʀᴋꜱ*:\x20','description','⭐\x20*ꜱᴛᴀʀꜱ*:\x20','get','1476314JMiOjg','Please\x20provide\x20a\x20GitHub\x20repository\x20name\x20in\x20the\x20format\x20📌`owner/repo`.','2553618hrmPpO','🔗\x20*ᴜʀʟ*:\x20','message','../command','sendMessage','📌\x20*ɴᴀᴍᴇ*:\x20','📁_*GitHub\x20Repository\x20Info*_📁\x0a\x0a','33502rDoFEp','28190808DASVDN','axios','4252mWmDEN','>\x20*ᴘᴏᴡᴇʀᴅ\x20ʙʏ\x20ꜱʜᴀᴅᴏᴡ\x20ᴍᴅ\x20➤*\x0a','join','766739UlfvRp','1388184tAJIuN','html_url','log','815FrQtNr'];_0xab12=function(){return _0x1bc6e6;};return _0xab12();}cmd({'pattern':'srepo','desc':'Fetch\x20information\x20about\x20a\x20GitHub\x20repository.','category':'other','react':'🍃','filename':__filename},async(_0xa97d0a,_0x359bea,_0x8a137c,{from:_0x41ee52,quoted:_0x1e6790,body:_0x4c0b8e,isCmd:_0x556e50,command:_0x4ff9a2,args:_0x175bfd,q:_0x702a4b,isGroup:_0x30424b,sender:_0x216db2,senderNumber:_0x2e4f11,botNumber2:_0x2e66cf,botNumber:_0x264249,pushname:_0x18bc57,isMe:_0x33e42c,isOwner:_0x3827ed,groupMetadata:_0x2f54c4,groupName:_0x1742b2,participants:_0x5d6f8f,groupAdmins:_0x10c4ec,isBotAdmins:_0x4cb95f,isAdmins:_0x4d60ba,reply:_0x543615})=>{const _0x167178=_0x7c537a;try{const _0x42a8c3=_0x175bfd[_0x167178(0x134)]('\x20');if(!_0x42a8c3)return _0x543615(_0x167178(0x127));const _0x3ae0d7=_0x167178(0x121)+_0x42a8c3,_0x1f3dd6=await axios[_0x167178(0x125)](_0x3ae0d7),_0x2998b8=_0x1f3dd6[_0x167178(0x11e)];let _0x222873=_0x167178(0x12e);_0x222873+=_0x167178(0x12d)+_0x2998b8[_0x167178(0x13a)]+'\x0a',_0x222873+=_0x167178(0x129)+_0x2998b8[_0x167178(0x137)]+'\x0a',_0x222873+='📝\x20*ᴅᴇꜱᴄʀɪᴘᴛɪᴏɴ*:\x20'+_0x2998b8[_0x167178(0x123)]+'\x0a',_0x222873+=_0x167178(0x124)+_0x2998b8[_0x167178(0x11f)]+'\x0a',_0x222873+=_0x167178(0x122)+_0x2998b8['forks_count']+'\x0a',_0x222873+='\x0a',_0x222873+=_0x167178(0x133),await _0xa97d0a[_0x167178(0x12c)](_0x41ee52,{'text':_0x222873},{'quoted':_0x359bea});}catch(_0x3bed2b){console[_0x167178(0x138)](_0x3bed2b),_0x543615('ᴇʀʀᴏʀ\x20ƒєт¢нιηg\x20яєρσѕιтσяу\x20ιηƒσ:\x20'+_0x3bed2b[_0x167178(0x12a)]);}});
