//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

const _0x5a6e19=_0x4802;function _0x4802(_0x581fe9,_0x275f04){const _0x270472=_0x2704();return _0x4802=function(_0x48023e,_0x484709){_0x48023e=_0x48023e-0x76;let _0x52e8b6=_0x270472[_0x48023e];return _0x52e8b6;},_0x4802(_0x581fe9,_0x275f04);}(function(_0x589585,_0x9d30cb){const _0x32294d=_0x4802,_0x551fe8=_0x589585();while(!![]){try{const _0x37b2e2=parseInt(_0x32294d(0x7e))/0x1*(parseInt(_0x32294d(0x7a))/0x2)+parseInt(_0x32294d(0x7f))/0x3*(-parseInt(_0x32294d(0x7d))/0x4)+parseInt(_0x32294d(0x77))/0x5+parseInt(_0x32294d(0x76))/0x6*(parseInt(_0x32294d(0x7c))/0x7)+parseInt(_0x32294d(0x79))/0x8+parseInt(_0x32294d(0x82))/0x9+-parseInt(_0x32294d(0x86))/0xa;if(_0x37b2e2===_0x9d30cb)break;else _0x551fe8['push'](_0x551fe8['shift']());}catch(_0x21f8f7){_0x551fe8['push'](_0x551fe8['shift']());}}}(_0x2704,0x78d47));const config=require(_0x5a6e19(0x81)),{cmd,commands}=require(_0x5a6e19(0x78));cmd({'pattern':_0x5a6e19(0x80),'desc':'To\x20get\x20the\x20bot\x20informations.','react':'👨‍🚀','category':_0x5a6e19(0x84),'filename':__filename},async(_0x593812,_0x1dc782,_0x1dd2be,{from:_0x31f047,quoted:_0x5742bb,body:_0x54e816,isCmd:_0x318fde,command:_0x55459d,args:_0x5ed7f3,q:_0x1934a3,isGroup:_0x595dbb,sender:_0x413317,senderNumber:_0x483a88,botNumber2:_0x4e8865,botNumber:_0x380f9b,pushname:_0x5db3f0,isMe:_0x3b2257,isOwner:_0x1c0613,groupMetadata:_0x2c831f,groupName:_0x39fcae,participants:_0x34c31c,groupAdmins:_0x4da130,isBotAdmins:_0x266944,isAdmins:_0x5ce01a,reply:_0x547aa2})=>{const _0x3435fa=_0x5a6e19;try{let _0x71e113=_0x3435fa(0x83)+_0x5db3f0+_0x3435fa(0x85);}catch(_0x345c44){_0x547aa2('*Error\x20!!*'),console[_0x3435fa(0x7b)](_0x345c44);}});function _0x2704(){const _0xa8f275=['584915GePZFp','../command','3975816hDvPiM','818nqAaxK','log','5572qXcofW','4UhRnFr','1949awbwJI','1862682VFnTHZ','support','../config','698643GkjWYw','\x20*👋\x20Hello\x20','main','*\x0a\x0a*⚒️\x20SHADOW-MD\x20Support\x20Channels⚒️*\x0a\x0a*Whatsapp\x20Channel\x20Link:*\x20Follow\x20the\x20𝐒𝐇𝐀𝐃𝐎𝐖\x20𝐌𝐃\x20channel\x20on\x20WhatsApp:\x20https://whatsapp.com/channel/0029Vajn0gb8F2pFh7PDqO0c\x0a\x0a>\x20❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣','13384630EaQMuS','7278CGGnpL'];_0x2704=function(){return _0xa8f275;};return _0x2704();}
