//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

const _0x355ba9=_0x39be;(function(_0x167cc3,_0x1b7568){const _0x1b788e=_0x39be,_0xdde9e4=_0x167cc3();while(!![]){try{const _0x5baafb=-parseInt(_0x1b788e(0x95))/0x1*(-parseInt(_0x1b788e(0x9f))/0x2)+parseInt(_0x1b788e(0xae))/0x3+parseInt(_0x1b788e(0x9b))/0x4*(-parseInt(_0x1b788e(0xa8))/0x5)+parseInt(_0x1b788e(0x9a))/0x6*(-parseInt(_0x1b788e(0x9e))/0x7)+-parseInt(_0x1b788e(0x98))/0x8*(parseInt(_0x1b788e(0xad))/0x9)+parseInt(_0x1b788e(0xa4))/0xa+parseInt(_0x1b788e(0x97))/0xb;if(_0x5baafb===_0x1b7568)break;else _0xdde9e4['push'](_0xdde9e4['shift']());}catch(_0x157f70){_0xdde9e4['push'](_0xdde9e4['shift']());}}}(_0x1658,0xb61d9));function _0x39be(_0x63f95f,_0x45c000){const _0x165883=_0x1658();return _0x39be=function(_0x39bee5,_0x21165c){_0x39bee5=_0x39bee5-0x95;let _0x3b2282=_0x165883[_0x39bee5];return _0x3b2282;},_0x39be(_0x63f95f,_0x45c000);}function _0x1658(){const _0x3350c8=['6126540rPUqXY','../command','\x0a\x0a├\x20📟\x20*Ram\x20usage:-*\x20','hostname','10rrrnmT','log','uptime','status','botinfo','1143GYjFtY','464943VPXNKp','9259yKMOpV','main','12261513OPdkzg','15632DKVPdH','MB\x0a\x0a├\x20⚙️\x20*Platform:-*\x20','30YlSTrZ','1822932MHUiKs','../config','heapUsed','1445185QgtLvg','228yQWoSH','totalmem','toFixed','../lib/functions','round'];_0x1658=function(){return _0x3350c8;};return _0x1658();}const config=require(_0x355ba9(0x9c)),{cmd,commands}=require(_0x355ba9(0xa5)),os=require('os'),{runtime}=require(_0x355ba9(0xa2));cmd({'pattern':'system','alias':[_0x355ba9(0xab),_0x355ba9(0xac)],'desc':'Check\x20up\x20time\x20,\x20ram\x20usage\x20and\x20more','category':_0x355ba9(0x96),'filename':__filename},async(_0x3a1c76,_0x2c45b4,_0xb9ae9,{from:_0x41bede,quoted:_0x3d5bfe,body:_0x4e1f71,isCmd:_0x43ca69,command:_0x264522,args:_0x1fd0f9,q:_0x3b5b63,isGroup:_0x2c202c,sender:_0x40a3f1,senderNumber:_0x12148c,botNumber2:_0x5ee45e,botNumber:_0xc77b29,pushname:_0x39aa9b,isMe:_0x65c28b,isOwner:_0x5002f8,groupMetadata:_0x50cdd6,groupName:_0xacd1,participants:_0x16f2e0,groupAdmins:_0x2b45b2,isBotAdmins:_0xb8d4a2,isAdmins:_0x386723,reply:_0x17808e})=>{const _0x3c1c70=_0x355ba9;try{let _0x4b1e14='┌───────────────────────\x0a\x0a├\x20⏰\x20*Runtime:-*\x20'+runtime(process[_0x3c1c70(0xaa)]())+_0x3c1c70(0xa6)+(process['memoryUsage']()[_0x3c1c70(0x9d)]/0x400/0x400)[_0x3c1c70(0xa1)](0x2)+'MB\x20/\x20'+Math[_0x3c1c70(0xa3)](require('os')[_0x3c1c70(0xa0)]/0x400/0x400)+_0x3c1c70(0x99)+os[_0x3c1c70(0xa7)]()+'\x0a\x0a├\x20👨‍💻\x20*Owners:-*\x20shadow-md\x0a\x0a├\x20🧬\x20*Version:-*\x206.0.0\x0a\x0a└───────────────────────\x0a\x0a*❯❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣*\x0a\x0a';return _0x17808e(''+_0x4b1e14);}catch(_0x25b731){console[_0x3c1c70(0xa9)](_0x25b731),_0x17808e(''+_0x25b731);}});
