//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

const _0x3375ac=_0x527b;function _0x3946(){const _0x163ca3=['trt','\x0a\x0a>\x20❯❯\x20ꜱʜᴀᴅᴏᴡ-ᴍᴅ\x20ᴡᴀᴛꜱ\x20ᴀᴘᴘ\x20ʙᴏᴛ\x20➣','toUpperCase','translatedText','https://api.mymemory.translated.net/get?q=','log','10SSazdy','3461932jmheEr','5CiZUYN','length','🌍\x20Translate\x20text\x20between\x20languages','⚠️\x20αη\x20єяяσя\x20σ¢¢υяяє∂\x20ωнιℓє\x20тяαηѕℓαтιηg\x20тнє\x20тєχт.\x20ρℓєαѕє\x20тяу\x20αgαιη\x20ℓαтєя.','&langpair=en|','\x0a\x0a🌍\x20*Translation*\x20🌍\x0a\x0a🔤\x20*Original*:\x20','45102sdiuum','get','8920314vsedJL','3224133AgoNrY','3222318MDskJR','1235496thyRWU','103162VGUQrT','../command','\x0a\x0a🌐\x20*Language*:\x20','10HmrcvW','\x0a\x0a🔠\x20*Translated*:\x20','data','917uQyZmo'];_0x3946=function(){return _0x163ca3;};return _0x3946();}(function(_0x5890d0,_0x2ec667){const _0x5df2b7=_0x527b,_0x2533a1=_0x5890d0();while(!![]){try{const _0x37a63c=parseInt(_0x5df2b7(0x91))/0x1*(parseInt(_0x5df2b7(0x83))/0x2)+parseInt(_0x5df2b7(0x8e))/0x3+-parseInt(_0x5df2b7(0x84))/0x4*(parseInt(_0x5df2b7(0x85))/0x5)+-parseInt(_0x5df2b7(0x8b))/0x6*(parseInt(_0x5df2b7(0x97))/0x7)+parseInt(_0x5df2b7(0x90))/0x8+parseInt(_0x5df2b7(0x8d))/0x9*(parseInt(_0x5df2b7(0x94))/0xa)+-parseInt(_0x5df2b7(0x8f))/0xb;if(_0x37a63c===_0x2ec667)break;else _0x2533a1['push'](_0x2533a1['shift']());}catch(_0x52dcfe){_0x2533a1['push'](_0x2533a1['shift']());}}}(_0x3946,0x90c3c));const axios=require('axios'),{cmd}=require(_0x3375ac(0x92));function _0x527b(_0x5ac6a4,_0x180076){const _0x3946fd=_0x3946();return _0x527b=function(_0x527b62,_0x458a65){_0x527b62=_0x527b62-0x7f;let _0x4b87cb=_0x3946fd[_0x527b62];return _0x4b87cb;},_0x527b(_0x5ac6a4,_0x180076);}cmd({'pattern':_0x3375ac(0x98),'desc':_0x3375ac(0x87),'react':'⚡','category':'other','filename':__filename},async(_0xe0c706,_0xa4d309,_0x3f030f,{from:_0x2425c5,q:_0x56146c,reply:_0x2ff78e})=>{const _0x166cf2=_0x3375ac;try{const _0x3aece9=_0x56146c['split']('\x20');if(_0x3aece9[_0x166cf2(0x86)]<0x2)return _0x2ff78e('❗\x20Please\x20provide\x20a\x20language\x20code\x20and\x20text.\x20Usage:\x20.translate\x20[language\x20code]\x20[text]');const _0x5d501b=_0x3aece9[0x0],_0xdc662c=_0x3aece9['slice'](0x1)['join']('\x20'),_0x4c42d5=_0x166cf2(0x81)+encodeURIComponent(_0xdc662c)+_0x166cf2(0x89)+_0x5d501b,_0x546441=await axios[_0x166cf2(0x8c)](_0x4c42d5),_0x136a75=_0x546441[_0x166cf2(0x96)]['responseData'][_0x166cf2(0x80)],_0x4bf10c=_0x166cf2(0x8a)+_0xdc662c+_0x166cf2(0x95)+_0x136a75+_0x166cf2(0x93)+_0x5d501b[_0x166cf2(0x7f)]()+_0x166cf2(0x99);return _0x2ff78e(_0x4bf10c);}catch(_0x1e3b86){return console[_0x166cf2(0x82)](_0x1e3b86),_0x2ff78e(_0x166cf2(0x88));}});
