//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                   // 𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

//░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
//██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
//╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
//░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
//██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
//╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

//███╗░░░███╗██████╗░
//████╗░████║██╔══██╗
//██╔████╔██║██║░░██║
//██║╚██╔╝██║██║░░██║
//██║░╚═╝░██║██████╔╝
//╚═╝░░░░░╚═╝╚═════╝░

//██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
//██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
//╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
//░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
//░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
//░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

//░█████╗░██╗░░░██╗
//██╔═══╝░██║░░░██║
//██████╗░╚██╗░██╔╝
//██╔══██╗░╚████╔╝░
//╚█████╔╝░░╚██╔╝░░
//░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.

function _0x5480(){const _0x5d657d=['speed','🌤\x20Get\x20weather\x20information\x20for\x20a\x20location','\x20hPa\x0a\x0a>\x20*ᴘᴏᴡᴇʀᴅ\x20ʙʏ\x20ꜱʜᴀᴅᴏᴡ\x20ᴍᴅ\x20➤*\x0a\x0a','pressure','temp_min','1169730fYGSoa','http://api.openweathermap.org/data/2.5/weather?q=','name','&units=metric','wind','2d61a72574c11c4f36173b627f8cb177','14LGbefR','❗\x20Please\x20provide\x20a\x20city\x20name..Usage:\x20.weather\x20[city\x20name]','log','status','4qgBQwZ','173986XfLeUT','humidity','main','../command','°C\x0a\x0a🌡️\x20*Min\x20Temp*:\x20','🌥️','°C\x0a\x0a💧\x20*Humidity*:\x20','\x0a\x0a🌍\x20*Weather\x20Information\x20for\x20','\x20m/s\x0a\x0a📌\x20*Pressure*:\x20','2373640SzCkZa','description','126750nalzTM','axios','4419180gGqXDx','3TCZdJv','../config','response','⚠️\x20αη\x20єяяσя\x20σ¢¢υяяє∂\x20ωнιℓє\x20тяαηѕℓαтιηg\x20тнє\x20тєχт.\x20ρℓєαѕє\x20тяу\x20αgαιη\x20ℓαтєя.','weather','\x0a\x0a💨\x20*Wind\x20Speed*:\x20','sys','%\x0a\x0a☁️\x20*Weather*:\x20','830115NZQWvo','&appid=','other','temp','temp_max','1910889TuHLGZ'];_0x5480=function(){return _0x5d657d;};return _0x5480();}const _0x13e844=_0x2208;(function(_0x1a751c,_0x4eb956){const _0x1a4d98=_0x2208,_0x5b0914=_0x1a751c();while(!![]){try{const _0x4bf257=-parseInt(_0x1a4d98(0x6a))/0x1*(-parseInt(_0x1a4d98(0x88))/0x2)+parseInt(_0x1a4d98(0x72))/0x3+-parseInt(_0x1a4d98(0x87))/0x4*(-parseInt(_0x1a4d98(0x7d))/0x5)+parseInt(_0x1a4d98(0x93))/0x6*(-parseInt(_0x1a4d98(0x83))/0x7)+-parseInt(_0x1a4d98(0x91))/0x8+parseInt(_0x1a4d98(0x77))/0x9+-parseInt(_0x1a4d98(0x95))/0xa;if(_0x4bf257===_0x4eb956)break;else _0x5b0914['push'](_0x5b0914['shift']());}catch(_0x4d8cf7){_0x5b0914['push'](_0x5b0914['shift']());}}}(_0x5480,0x31946));function _0x2208(_0x5b7048,_0x29e70a){const _0x54800a=_0x5480();return _0x2208=function(_0x220834,_0x4ff9b7){_0x220834=_0x220834-0x6a;let _0xa0d047=_0x54800a[_0x220834];return _0xa0d047;},_0x2208(_0x5b7048,_0x29e70a);}const axios=require(_0x13e844(0x94)),config=require(_0x13e844(0x6b)),{cmd,commands}=require(_0x13e844(0x8b));cmd({'pattern':'weather','desc':_0x13e844(0x79),'react':_0x13e844(0x8d),'category':_0x13e844(0x74),'filename':__filename},async(_0x2b39dd,_0x5dbd52,_0x263069,{from:_0x4e873f,q:_0x46d0bb,reply:_0x3d8d85})=>{const _0x3dfe2b=_0x13e844;try{if(!_0x46d0bb)return _0x3d8d85(_0x3dfe2b(0x84));const _0x13e313=_0x3dfe2b(0x82),_0xfcfea0=_0x46d0bb,_0x34e4fe=_0x3dfe2b(0x7e)+_0xfcfea0+_0x3dfe2b(0x73)+_0x13e313+_0x3dfe2b(0x80),_0x21ccaa=await axios['get'](_0x34e4fe),_0x1a2ba8=_0x21ccaa['data'],_0x549305=_0x3dfe2b(0x8f)+_0x1a2ba8[_0x3dfe2b(0x7f)]+',\x20'+_0x1a2ba8[_0x3dfe2b(0x70)]['country']+'*\x20🌍\x0a\x0a🌡️\x20*Temperature*:\x20'+_0x1a2ba8[_0x3dfe2b(0x8a)][_0x3dfe2b(0x75)]+'°C\x0a\x0a🌡️\x20*Feels\x20Like*:\x20'+_0x1a2ba8[_0x3dfe2b(0x8a)]['feels_like']+_0x3dfe2b(0x8c)+_0x1a2ba8['main'][_0x3dfe2b(0x7c)]+'°C\x0a\x0a🌡️\x20*Max\x20Temp*:\x20'+_0x1a2ba8[_0x3dfe2b(0x8a)][_0x3dfe2b(0x76)]+_0x3dfe2b(0x8e)+_0x1a2ba8[_0x3dfe2b(0x8a)][_0x3dfe2b(0x89)]+_0x3dfe2b(0x71)+_0x1a2ba8[_0x3dfe2b(0x6e)][0x0][_0x3dfe2b(0x8a)]+'\x0a\x0a🌫️\x20*Description*:\x20'+_0x1a2ba8[_0x3dfe2b(0x6e)][0x0][_0x3dfe2b(0x92)]+_0x3dfe2b(0x6f)+_0x1a2ba8[_0x3dfe2b(0x81)][_0x3dfe2b(0x78)]+_0x3dfe2b(0x90)+_0x1a2ba8[_0x3dfe2b(0x8a)][_0x3dfe2b(0x7b)]+_0x3dfe2b(0x7a);return _0x3d8d85(_0x549305);}catch(_0x6040a5){console[_0x3dfe2b(0x85)](_0x6040a5);if(_0x6040a5['response']&&_0x6040a5[_0x3dfe2b(0x6c)][_0x3dfe2b(0x86)]===0x194)return _0x3d8d85('🚫\x20¢ιту\x20ησт\x20ƒσυη∂.\x20ρℓєαѕє\x20¢нє¢к\x20тнє\x20ѕρєℓℓιηg\x20αη∂\x20тяу\x20αgαιη.');return _0x3d8d85(_0x3dfe2b(0x6d));}});
