//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                    𝗦𝗛𝗔𝗗𝗢𝗪  𝐁𝐎𝐓                                                 //
//                                                                                                      //
//                                         Ｖ：6.0                                                       //

//
//──────────────────────────────────────//──────────────────────────────────────
//

░██████╗██╗░░██╗░█████╗░██████╗░░█████╗░░██╗░░░░░░░██╗
██╔════╝██║░░██║██╔══██╗██╔══██╗██╔══██╗░██║░░██╗░░██║
╚█████╗░███████║███████║██║░░██║██║░░██║░╚██╗████╗██╔╝
░╚═══██╗██╔══██║██╔══██║██║░░██║██║░░██║░░████╔═████║░
██████╔╝██║░░██║██║░░██║██████╔╝╚█████╔╝░░╚██╔╝░╚██╔╝░
╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═════╝░░╚════╝░░░░╚═╝░░░╚═╝░░

███╗░░░███╗██████╗░
████╗░████║██╔══██╗
██╔████╔██║██║░░██║
██║╚██╔╝██║██║░░██║
██║░╚═╝░██║██████╔╝
╚═╝░░░░░╚═╝╚═════╝░

██╗░░░██╗███████╗██████╗░░██████╗██╗░█████╗░███╗░░██╗
██║░░░██║██╔════╝██╔══██╗██╔════╝██║██╔══██╗████╗░██║
╚██╗░██╔╝█████╗░░██████╔╝╚█████╗░██║██║░░██║██╔██╗██║
░╚████╔╝░██╔══╝░░██╔══██╗░╚═══██╗██║██║░░██║██║╚████║
░░╚██╔╝░░███████╗██║░░██║██████╔╝██║╚█████╔╝██║░╚███║
░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═════╝░╚═╝░╚════╝░╚═╝░░╚══╝

░█████╗░██╗░░░██╗
██╔═══╝░██║░░░██║
██████╗░╚██╗░██╔╝
██╔══██╗░╚████╔╝░
╚█████╔╝░░╚██╔╝░░
░╚════╝░░░░╚═╝░░░
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//*
//  * @project_name : SHADOW-MD
//  * @author : LAKSHAN DAMAYANTHA
//  * @description : SHADOW ,A Multi-functional whatsapp user bot.
const _0x1fdbf2=_0x544e;(function(_0x20eb86,_0x1a427e){const _0x4e3e71=_0x544e,_0x4b8cd8=_0x20eb86();while(!![]){try{const _0x507ac4=parseInt(_0x4e3e71(0x11d))/0x1*(-parseInt(_0x4e3e71(0x114))/0x2)+-parseInt(_0x4e3e71(0x10d))/0x3*(-parseInt(_0x4e3e71(0x11c))/0x4)+parseInt(_0x4e3e71(0x112))/0x5*(parseInt(_0x4e3e71(0x10c))/0x6)+parseInt(_0x4e3e71(0x115))/0x7*(-parseInt(_0x4e3e71(0x118))/0x8)+parseInt(_0x4e3e71(0x121))/0x9*(-parseInt(_0x4e3e71(0x119))/0xa)+-parseInt(_0x4e3e71(0x110))/0xb*(parseInt(_0x4e3e71(0x111))/0xc)+parseInt(_0x4e3e71(0x11f))/0xd;if(_0x507ac4===_0x1a427e)break;else _0x4b8cd8['push'](_0x4b8cd8['shift']());}catch(_0x29a20c){_0x4b8cd8['push'](_0x4b8cd8['shift']());}}}(_0x318b,0x1f1f4));function _0x544e(_0x1a3e90,_0x17c89a){const _0x318bdd=_0x318b();return _0x544e=function(_0x544ed0,_0x52b3ae){_0x544ed0=_0x544ed0-0x10a;let _0x1d91dd=_0x318bdd[_0x544ed0];return _0x1d91dd;},_0x544e(_0x1a3e90,_0x17c89a);}function _0x318b(){const _0x109268=['3210YdjLFy','184488JBAdck','title','../command','11kMjnmE','971364mNCvLt','2035FDIAmZ','url','10WaYiZG','154kMQjbw','yt-search','map','65680BBugEO','40mYxXtl','log','sendMessage','4wITOuy','30554AIkLwI','.yts\x20lelena','5435508vEvyhe','videos','349974dFexFz','*\x0a🔗\x20','ytsearch'];_0x318b=function(){return _0x109268;};return _0x318b();}const {cmd}=require(_0x1fdbf2(0x10f)),yts=require(_0x1fdbf2(0x116));cmd({'pattern':'yts','alias':[_0x1fdbf2(0x10b)],'use':_0x1fdbf2(0x11e),'react':'🔎','desc':'Search\x20videos\x20from\x20youtube','category':'search','filename':__filename},async(_0x4e5e9b,_0x4ce8c8,_0xd98fa2,{from:_0x47e8b7,q:_0x1ff883,reply:_0x4b64ea})=>{const _0x42f4a8=_0x1fdbf2;try{if(!_0x1ff883)return await _0x4b64ea('*Please\x20enter\x20a\x20query\x20to\x20search!*');var _0x459bae=await yts(_0x1ff883),_0x5d3449='';_0x459bae[_0x42f4a8(0x120)][_0x42f4a8(0x117)](_0x2489c4=>{const _0x14723f=_0x42f4a8;_0x5d3449+='\x20*🖲️'+_0x2489c4[_0x14723f(0x10e)]+_0x14723f(0x10a)+_0x2489c4[_0x14723f(0x113)]+'\x0a\x0a';}),await _0x4e5e9b[_0x42f4a8(0x11b)](_0x47e8b7,{'text':_0x5d3449},{'quoted':_0x4ce8c8});}catch(_0x35134d){console[_0x42f4a8(0x11a)](_0x35134d),_0x4b64ea('*Error\x20!!*');}});
